HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_41_drun.c
    g_foc_mode      = FOC_MODE_ALIGN;
    g_foc_phase     = 4u;
    g_foc_theta_rad = FOC_MATH_HALF_PI;
    g_foc_id_ma     = 0.0f;
    g_foc_iq_ma     = 0.0f;
    g_foc_vd        = 0.0f;
    g_foc_vq        = 0.0f;
    Foc_Core_SetStateMachine(FOC_STATE_ALIGN);
    Foc_Core_ResetEma();
    g_foc_align_state = 1u;
    PID_Reset(&s_pid_id);
    PID_Reset(&s_pid_iq);

    g_drun41_running = 1u;
    g_drun41_state = FOC41_STEP_RUN;
    Foc_Core_PwmStart();
    FOC41_LOG("start rot=%d cnt dlt=%d->%d deg tr=%ums Iref=%dmA kp=%dm iValid=%u",
               (int)s_rotor_count,
               (int)g_drun41_dlt_init_deg, (int)g_drun41_dlt_targ_deg,
               (unsigned)g_drun41_dlt_tr_ms, (int)g_drun41_i_ref_ma,
               (int)(g_drun41_pid_iq_cfg.kp * 1000.0f),
               (unsigned)g_drun41_pid_iq_cfg.i_valid);
}

void Foc_Drun41_Stop(void)
{
    if (g_drun41_running) {
        g_drun41_running = 0u;
        g_foc_align_state = 0u;
        if (g_foc_active) {
            g_foc_active = 0u;
            Foc_Core_PwmStop();
            Foc_Core_SetStateMachine(FOC_STATE_IDLE);
        }
        FOC41_LOG("stopped");
    }
    Drun41_ClearCurrentFeedback();
}

void Foc_Drun41_Step(const stc_i_data_t *pData)
{
    stc_i_data_t data;
    float id, iq, ramp_step, delta_deg, delta_rad, id_ref, iq_ref, vd, vq;
    float valpha, vbeta, du, dv, dw, cos_r, sin_r, rotor_rad, progress;
    uint16_t hardware_count;
    uint32_t ramp_ticks;
    int32_t hardware_delta, corrected_delta, field_deg, rotor_deg, angle_diff;
    uint32_t now_us;

    if (Foc_Core_OverCurrent(pData)) {
        g_drun41_state = FOC41_STEP_FAULT_OC;
        g_drun41_evt = FOC41_EVT_OC;
        g_drun41_running = 0u;
        Foc_Core_FaultStop(1u);
        Drun41_ClearCurrentFeedback();
        return;
    }

    if (g_drun41_state != FOC41_STEP_RUN) {
        return;
    }

    now_us = Drun41_TimeUpdate();
    ramp_ticks = g_drun41_dlt_tr_ms * (FOC_ISR_HZ / 1000u);
    if (ramp_ticks == 0u) {
        progress = 1.0f;
    } else {
        progress = (float)s_run_tick / (float)ramp_ticks;
        if (progress > 1.0f) progress = 1.0f;
    }
    delta_deg = g_drun41_dlt_init_deg
              + (g_drun41_dlt_targ_deg - g_drun41_dlt_init_deg) * progress;
    g_drun41_dlt_now_deg = delta_deg;
    if ((s_ramp_done == 0u) && (s_run_tick >= ramp_ticks)) {
        s_ramp_done = 1u;
        g_drun41_evt = FOC41_EVT_RAMP_DONE;
    }
    s_run_tick++;

    hardware_count = TMRA_GetCountValue(CM_TMRA_1);
    if (s_encoder_initialized == 0u) {
        s_encoder_prev_hw = hardware_count;
        s_encoder_initialized = 1u;
    }
    hardware_delta = (int32_t)(int16_t)((uint16_t)hardware_count - s_encoder_prev_hw);
    s_encoder_prev_hw = hardware_count;
    if (hardware_delta > FOC41_ENC_DELTA_MAX) {
        hardware_delta = FOC41_ENC_DELTA_MAX;
    }
    if (hardware_delta < -FOC41_ENC_DELTA_MAX) {
        hardware_delta = -FOC41_ENC_DELTA_MAX;
    }
    corrected_delta = hardware_delta * (int32_t)g_foc_enc_dir;
    s_rotor_count = Foc_Core_ModPos(s_rotor_count + corrected_delta,
                                    (int32_t)ENCODER_CPR);
    g_drun41_rotor_count = s_rotor_count;

    rotor_rad = (float)s_rotor_count * (FOC_MATH_2PI * (float)FOC_POLE_PAIRS
                                       / (float)ENCODER_CPR);
    rotor_rad -= (float)((int32_t)(rotor_rad * (1.0f / FOC_MATH_2PI))) * FOC_MATH_2PI;
    if (rotor_rad < 0.0f) rotor_rad += FOC_MATH_2PI;

    data = Drun41_CorrectedData(pData);
    Foc_Core_GetDq(&data, rotor_rad, &id, &iq);
    g_drun41_id_ma = id * 1000.0f;
    g_drun41_iq_ma = iq * 1000.0f;
    {
        float alpha = g_drun41_iq_filt_alpha;
        if (alpha <= 0.0f || alpha > 1.0f) {
            alpha = 1.0f;
        }
        if (s_iq_filt_init == 0u) {
            g_drun41_iq_filt_ma = g_drun41_iq_ma;
            s_iq_filt_init = 1u;
        } else {
            g_drun41_iq_filt_ma += alpha
                                   * (g_drun41_iq_ma - g_drun41_iq_filt_ma);
        }
    }
    g_foc_id_ma = g_drun41_id_ma;
    g_foc_iq_ma = g_drun41_iq_ma;
    Drun41_PpFeed(id, iq);

    s_id_sum_ma += (int32_t)(id * 1000.0f);
    s_iq_sum_ma += (int32_t)(iq * 1000.0f);
    if (++s_mean_tick >= FOC41_MEAN_WIN_TICKS) {
        s_mean_tick = 0u;
        g_drun41_id_mean_ma = (float)s_id_sum_ma / (float)FOC41_MEAN_WIN_TICKS;
        g_drun41_iq_mean_ma = (float)s_iq_sum_ma / (float)FOC41_MEAN_WIN_TICKS;
        s_id_sum_ma = 0;
        s_iq_sum_ma = 0;
    }

    if (g_drun41_i_ramp_ma_s > 0.0f) {
        ramp_step = g_drun41_i_ramp_ma_s / (float)FOC_ISR_HZ;
        if (s_i_ref_ramp < g_drun41_i_ref_ma) {
            s_i_ref_ramp += ramp_step;
            if (s_i_ref_ramp > g_drun41_i_ref_ma) s_i_ref_ramp = g_drun41_i_ref_ma;
        } else if (s_i_ref_ramp > g_drun41_i_ref_ma) {
            s_i_ref_ramp -= ramp_step;
            if (s_i_ref_ramp < g_drun41_i_ref_ma) s_i_ref_ramp = g_drun41_i_ref_ma;
        }
    } else {
        s_i_ref_ramp = g_drun41_i_ref_ma;
    }

    delta_rad = delta_deg * FOC41_DEG2RAD;
    id_ref = (s_i_ref_ramp * 0.001f) * Foc_Math_Cos(delta_rad);
    iq_ref = (s_i_ref_ramp * 0.001f) * Foc_Math_Sin(delta_rad);
    g_drun41_id_ref_ma = id_ref * 1000.0f;
    g_drun41_iq_ref_ma = iq_ref * 1000.0f;
    Drun41_StepFeed(&s_id_step, &g_drun41_id_step_state,
                    &g_drun41_id_step_target_ma,
                    &g_drun41_id_step_t90_us,
                    g_drun41_id_ref_ma, g_drun41_id_ma, now_us);
    Drun41_StepFeed(&s_iq_step, &g_drun41_iq_step_state,
                    &g_drun41_iq_step_target_ma,
                    &g_drun41_iq_step_t90_us,
                    g_drun41_iq_ref_ma, g_drun41_iq_ma, now_us);

    vd = PID_UpdateUs(&s_pid_id, id_ref, id, FOC41_ISR_DT_US);
    vq = PID_UpdateUs(&s_pid_iq, iq_ref, iq, FOC41_ISR_DT_US);
    g_drun41_vd_pi_v = vd;
    g_drun41_vq_pi_v = vq;

    /* g_drun41_speed_hz is electrical speed, refreshed by the 200 ms speed
     * window.  Keep the first feed-forward updates at zero until enough
     * encoder samples have accumulated. */
    g_drun41_omega_e_rad_s = FOC_MATH_2PI * g_drun41_speed_hz;
    if (g_drun41_ff_enable != 0u) {
        const float ls_h = (float)FOC_MOTOR_LS_UH * 0.000001f;

        g_drun41_vd_ff_v = -g_drun41_ff_cross_gain
                           * g_drun41_omega_e_rad_s * ls_h * iq;
        g_drun41_vq_ff_v = g_drun41_ff_cross_gain
                           * g_drun41_omega_e_rad_s * ls_h * id
                           + g_drun41_ff_bemf_gain
                           * g_drun41_omega_e_rad_s * (float)FOC_MOTOR_FLUX_VS
                           + g_drun41_ff_res_gain
                           * (float)FOC_MOTOR_RS_OHM * iq_ref;
        vd += g_drun41_vd_ff_v;
        vq += g_drun41_vq_ff_v;

