HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_41_drun.c
        /* PI outputs are independently clamped.  After adding feed-forward,
         * limit the total dq vector so SVPWM is not asked for an excessive
         * circular voltage. */
        if (g_drun41_vmax_v > 0.0f) {
            float v2 = vd * vd + vq * vq;
            float vmax2 = g_drun41_vmax_v * g_drun41_vmax_v;
            if (v2 > vmax2) {
                float scale = g_drun41_vmax_v / sqrtf(v2);
                vd *= scale;
                vq *= scale;
                g_drun41_vsat = 1u;
            } else {
                g_drun41_vsat = ((vd <= -FOC41_PI_UMAX_V + 0.01f) ||
                                 (vd >=  FOC41_PI_UMAX_V - 0.01f) ||
                                 (vq <= -FOC41_PI_UMAX_V + 0.01f) ||
                                 (vq >=  FOC41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
            }
        } else {
            g_drun41_vsat = ((vd <= -FOC41_PI_UMAX_V + 0.01f) ||
                             (vd >=  FOC41_PI_UMAX_V - 0.01f) ||
                             (vq <= -FOC41_PI_UMAX_V + 0.01f) ||
                             (vq >=  FOC41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
        }
    } else {
        g_drun41_vd_ff_v = 0.0f;
        g_drun41_vq_ff_v = 0.0f;
        g_drun41_vsat = ((vd <= -FOC41_PI_UMAX_V + 0.01f) ||
                         (vd >=  FOC41_PI_UMAX_V - 0.01f) ||
                         (vq <= -FOC41_PI_UMAX_V + 0.01f) ||
                         (vq >=  FOC41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
    }

    g_foc_vd = vd;
    g_foc_vq = vq;

    cos_r = Foc_Math_Cos(rotor_rad);
    sin_r = Foc_Math_Sin(rotor_rad);
    valpha = vd * cos_r - vq * sin_r;
    vbeta  = vd * sin_r + vq * cos_r;
    Foc_Svpwm(valpha, vbeta, FOC_VBUS_V, &du, &dv, &dw);
    TMR4_PWM_SetDuty3Phase(du, dv, dw);

    g_foc_valpha = valpha;
    g_foc_vbeta = vbeta;
    g_foc_theta_rad = rotor_rad;
    g_foc_du = du;
    g_foc_dv = dv;
    g_foc_dw = dw;
    g_drun41_du = du;
    g_drun41_dv = dv;
    g_drun41_dw = dw;

    {
        int32_t error_d = (int32_t)((id_ref - id) * 1000.0f);
        int32_t error_q = (int32_t)((iq_ref - iq) * 1000.0f);

        if (s_err_init == 0u) {
            s_ed_min = s_ed_max = (float)error_d;
            s_eq_min = s_eq_max = (float)error_q;
            s_err_init = 1u;
        } else {
            if (error_d < s_ed_min) s_ed_min = (float)error_d;
            if (error_d > s_ed_max) s_ed_max = (float)error_d;
            if (error_q < s_eq_min) s_eq_min = (float)error_q;
            if (error_q > s_eq_max) s_eq_max = (float)error_q;
        }
        s_ed_sum_ma += error_d;
        s_eq_sum_ma += error_q;
        if (++s_err_tick >= FOC41_ERR_WIN_TICKS) {
            s_err_tick = 0u;
            g_drun41_ed_mean_ma = (float)s_ed_sum_ma / (float)FOC41_ERR_WIN_TICKS;
            g_drun41_eq_mean_ma = (float)s_eq_sum_ma / (float)FOC41_ERR_WIN_TICKS;
            g_drun41_ed_pp_ma = s_ed_max - s_ed_min;
            g_drun41_eq_pp_ma = s_eq_max - s_eq_min;
            s_ed_sum_ma = 0;
            s_eq_sum_ma = 0;
            s_ed_min = s_ed_max = (float)error_d;
            s_eq_min = s_eq_max = (float)error_q;
        }
    }

    s_speed_acc += corrected_delta;
    if (++s_speed_tick >= FOC41_SPEED_WIN_TICKS) {
        g_drun41_speed_hz = (float)s_speed_acc * (float)FOC_POLE_PAIRS
                          * (1000.0f / (float)FOC41_SPEED_WIN_MS)
                          / (float)ENCODER_CPR;
        s_speed_tick = 0u;
        s_speed_acc = 0;
    }

    field_deg = (int32_t)((rotor_rad + delta_rad) * FOC41_RAD2DEG);
    if (field_deg >= 360) field_deg -= 360;
    rotor_deg = (int32_t)(rotor_rad * FOC41_RAD2DEG);
    angle_diff = field_deg - rotor_deg;
    angle_diff = 180 - Foc_Core_ModPos(180 - angle_diff, 360);
    g_drun41_field_deg = field_deg;
    g_drun41_rotor_deg = rotor_deg;
    g_drun41_diff_deg = angle_diff;
}

/*===========================================================================
 * mode 41 自持 VOFA：固定 21ch 布局
 * 通道含义速览卡 = foc_41_drun.h 顶部【模式速览卡】（唯一事实源）
 *
 * ch0~18 与 mode 29 完全一致（便于 A/B 对比），ch19/20 是本模式特有的
 * **前馈电压分量** —— 前馈实验的核心观测量，必须能直接看到。
 * 单位换算：传"毫单位"，SendScaled 内部 ×0.001（电流 mA→A，电压 mV→V）
 *===========================================================================*/
int Foc_Drun41_VofaFill(int32_t *cur)
{
    cur[0]  = (int32_t)(g_i_iu_ma);                  /* ch0  U 相电流 (mA -> A) */
    cur[1]  = (int32_t)(g_i_iv_ma);                  /* ch1  V 相电流 */
    cur[2]  = (int32_t)(g_i_iw_ma);                  /* ch2  W 相电流 */
    cur[3]  = (int32_t)(g_foc_ialpha * 1000.0f);     /* ch3  静止系 ialpha */
    cur[4]  = (int32_t)(g_foc_ibeta  * 1000.0f);     /* ch4  静止系 ibeta */
    cur[5]  = (int32_t)(g_foc_iq_ma);                /* ch5  iq 反馈 ← 环反馈 */
    cur[6]  = (int32_t)(g_foc_id_ma);                /* ch6  id 反馈 ← 环反馈 */
    cur[7]  = (int32_t)(g_drun41_iq_ref_ma);         /* ch7  iq 参考 */
    cur[8]  = (int32_t)(g_drun41_id_ref_ma);         /* ch8  id 参考（不恒为 0！） */
    cur[9]  = (int32_t)(g_foc_vq * 1000.0f);         /* ch9  vq 总输出（含前馈） */
    cur[10] = (int32_t)(g_foc_vd * 1000.0f);         /* ch10 vd 总输出（含前馈） */
    cur[11] = (int32_t)(g_drun41_eq_mean_ma);        /* ch11 q 轴误差均值 ← 主判据 */
    cur[12] = (int32_t)(g_drun41_ed_mean_ma);        /* ch12 d 轴误差均值 */
    cur[13] = (int32_t)(g_drun41_iq_mean_ma);        /* ch13 iq 3s 均值 */
    cur[14] = (int32_t)(g_drun41_id_mean_ma);        /* ch14 id 3s 均值 */
    cur[15] = (int32_t)(g_drun41_eq_pp_ma);          /* ch15 q 轴误差峰峰值（振铃判据） */
    cur[16] = (int32_t)(g_drun41_iq_filt_ma);        /* ch16 显示用滤波 iq（PI 不用） */
    cur[17] = (int32_t)(g_drun41_diff_deg * 1000);   /* ch17 功角 delta (mdeg -> deg) */
    cur[18] = (int32_t)(g_drun41_speed_hz * 1000.0f);/* ch18 实测电频率 (mHz -> Hz) */
    cur[19] = (int32_t)(g_drun41_vd_ff_v * 1000.0f); /* ch19 **d 轴前馈电压** ← 本模式专属 */
    cur[20] = (int32_t)(g_drun41_vq_ff_v * 1000.0f); /* ch20 **q 轴前馈电压** ← 本模式专属 */
    return 21;
}
